Masmiseim36/nxpSDK/devices/MKE13Z7/MKE13Z7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>DMAMUX</name>
      <description>DMA channel multiplexor</description>
      <groupName>DMAMUX</groupName>
      <prependToName>DMAMUX_</prependToName>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>CHCFG%s</name>
          <description>Channel Configuration register</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>DMA Channel Source (Slot)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable_Signal</name>
                  <description>Disable_Signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSI0_Signal</name>
                  <description>TSI0_Signal</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART0_Rx_Signal</name>
                  <description>LPUART0_Rx_Signal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART0_Tx_Signal</name>
                  <description>LPUART0_Tx_Signal</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART1_Rx_Signal</name>
                  <description>LPUART1_Rx_Signal</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART1_Tx_Signal</name>
                  <description>LPUART1_Tx_Signal</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART2_Rx_Signal</name>
                  <description>LPUART2_Rx_Signal</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPUART2_Tx_Signal</name>
                  <description>LPUART2_Tx_Signal</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FlexIO_Channel0_Signal</name>
                  <description>FlexIO_Channel0_Signal</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FlexIO_Channel1_Signal</name>
                  <description>FlexIO_Channel1_Signal</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FlexIO_Channel2_Signal</name>
                  <description>FlexIO_Channel2_Signal</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FlexIO_Channel3_Signal</name>
                  <description>FlexIO_Channel3_Signal</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI0_Rx_Signal</name>
                  <description>LPSPI0_Rx_Signal</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI0_Tx_Signal</name>
                  <description>LPSPI0_Tx_Signal</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C0_Rx_Signal</name>
                  <description>LPI2C0_Rx_Signal</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C0_Tx_Signal</name>
                  <description>LPI2C0_Tx_Signal</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0_Channel0_Signal</name>
                  <description>FTM0_Channel0_Signal</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0_Channel1_Signal</name>
                  <description>FTM0_Channel1_Signal</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0_Channel2_Signal</name>
                  <description>FTM0_Channel2_Signal</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0_Channel3_Signal</name>
                  <description>FTM0_Channel3_Signal</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0_Channel4_Signal</name>
                  <description>FTM0_Channel4_Signal</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0_Channel5_Signal</name>
                  <description>FTM0_Channel5_Signal</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0_Channel6_Signal</name>
                  <description>FTM0_Channel6_Signal</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0_Channel7_Signal</name>
                  <description>FTM0_Channel7_Signal</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM1_Channel0_Signal</name>
                  <description>FTM1_Channel0_Signal</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM1_Channel1_Signal</name>
                  <description>FTM1_Channel1_Signal</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM2_Channel0_Signal</name>
                  <description>FTM2_Channel0_Signal</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM2_Channel1_Signal</name>
                  <description>FTM2_Channel1_Signal</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_Signal</name>
                  <description>ADC0_Signal</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMP0_Signal</name>
                  <description>CMP0_Signal</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PortA_Signal</name>
                  <description>PortA_Signal</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PortB_Signal</name>
                  <description>PortB_Signal</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PortC_Signal</name>
                  <description>PortC_Signal</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PortD_Signal</name>
                  <description>PortD_Signal</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PortE_Signal</name>
                  <description>PortE_Signal</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM1_Channel2_Signal</name>
                  <description>FTM1_Channel2_Signal</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM2_Channel2_Signal</name>
                  <description>FTM2_Channel2_Signal</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPTMR0_Signal</name>
                  <description>LPTMR0_Signal</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AlwaysOn60_Signal</name>
                  <description>AlwaysOn60_Signal</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AlwaysOn61_Signal</name>
                  <description>AlwaysOn61_Signal</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AlwaysOn62_Signal</name>
                  <description>AlwaysOn62_Signal</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AlwaysOn63_Signal</name>
                  <description>AlwaysOn63_Signal</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG</name>
              <description>DMA Channel Trigger Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Triggering is disabled. If triggering is disabled and ENBL is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Triggering is enabled. If triggering is enabled and ENBL is set, the DMAMUX is in Periodic Trigger mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENBL</name>
              <description>DMA Channel Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>DMA channel is disabled. This mode is primarily used during configuration of the DMAMux. The DMA has separate channel enables/disables, which should be used to disable or reconfigure a DMA channel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>DMA channel is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
