Masmiseim36/nxpSDK/devices/MKE13Z7/MKE13Z7.xml
        <register>
          <name>OUTINIT</name>
          <description>Initial State For Channels Output</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0OI</name>
              <description>Channel 0 Output Initialization Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOI_zero</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOI_one</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1OI</name>
              <description>Channel 1 Output Initialization Value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOI_zero</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOI_one</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2OI</name>
              <description>Channel 2 Output Initialization Value</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOI_zero</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOI_one</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3OI</name>
              <description>Channel 3 Output Initialization Value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOI_zero</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOI_one</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4OI</name>
              <description>Channel 4 Output Initialization Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOI_zero</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOI_one</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5OI</name>
              <description>Channel 5 Output Initialization Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOI_zero</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOI_one</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6OI</name>
              <description>Channel 6 Output Initialization Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOI_zero</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOI_one</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7OI</name>
              <description>Channel 7 Output Initialization Value</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOI_zero</name>
                  <description>The initialization value is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOI_one</name>
                  <description>The initialization value is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTMASK</name>
          <description>Output Mask</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0OM</name>
              <description>Channel 0 Output Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOM_normal</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOM_inactive</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1OM</name>
              <description>Channel 1 Output Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOM_normal</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOM_inactive</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2OM</name>
              <description>Channel 2 Output Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOM_normal</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOM_inactive</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3OM</name>
              <description>Channel 3 Output Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOM_normal</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOM_inactive</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4OM</name>
              <description>Channel 4 Output Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOM_normal</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOM_inactive</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5OM</name>
              <description>Channel 5 Output Mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOM_normal</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOM_inactive</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6OM</name>
              <description>Channel 6 Output Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOM_normal</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOM_inactive</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7OM</name>
              <description>Channel 7 Output Mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHOM_normal</name>
                  <description>Channel output is not masked. It continues to operate normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHOM_inactive</name>
                  <description>Channel output is masked. It is forced to its inactive state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
