Masmiseim36/nxpSDK/devices/MKE13Z7/MKE13Z7.xml
        <register>
          <name>SSC2</name>
          <description>TSI SSC Register 2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10080101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MOVE_REPEAT_NUM</name>
              <description>MOVE_REPEAT_NUM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_0</name>
                  <description>The up_down counter will be updated for every sample-charge cycle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_1</name>
                  <description>The up_down counter will be updated for every 2 sample-charge cycles.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_2</name>
                  <description>The up_down counter will be updated for every 3 sample-charge cycles.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_3</name>
                  <description>The up_down counter will be updated for every 4 sample-charge cycles.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_4</name>
                  <description>The up_down counter will be updated for every 5 sample-charge cycles.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_5</name>
                  <description>The up_down counter will be updated for every 6 sample-charge cycles.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_6</name>
                  <description>The up_down counter will be updated for every 7 sample-charge cycles.</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOVE_STEPS_NUM</name>
              <description>MOVE_STEPS_NUM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_0</name>
                  <description>The added value for up-down counter is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_1</name>
                  <description>The added value for up-down counter is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_2</name>
                  <description>The added value for up-down counter is 2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_3</name>
                  <description>The added value for up-down counter is 3.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_4</name>
                  <description>The added value for up-down counter is 4.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_5</name>
                  <description>The added value for up-down counter is 5.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_6</name>
                  <description>The added value for up-down counter is 6.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_7</name>
                  <description>The added value for up-down counter is 7.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOVE_NOCHARGE_MAX</name>
              <description>MOVE_NOCHARGE_MAX</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOVE_NOCHARGE_MIN</name>
              <description>MOVE_NOCHARGE_MIN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_0</name>
                  <description>The SSC output bit 1's min period will be (1 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycle of divided system clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_1</name>
                  <description>The SSC output bit 1's min period will be (2 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_2</name>
                  <description>The SSC output bit 1's min period will be (3 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_3</name>
                  <description>The SSC output bit 1's min period will be (4 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_4</name>
                  <description>The SSC output bit 1's min period will be (5 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_5</name>
                  <description>The SSC output bit 1's min period will be (6 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_6</name>
                  <description>The SSC output bit 1's min period will be (7 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_7</name>
                  <description>The SSC output bit 1's min period will be (8 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_8</name>
                  <description>The SSC output bit 1's min period will be (9 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_9</name>
                  <description>The SSC output bit 1's min period will be (10 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_10</name>
                  <description>The SSC output bit 1's min period will be (11 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_11</name>
                  <description>The SSC output bit 1's min period will be (12 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_12</name>
                  <description>The SSC output bit 1's min period will be (13 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_13</name>
                  <description>The SSC output bit 1's min period will be (14 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_14</name>
                  <description>The SSC output bit 1's min period will be (15 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_15</name>
                  <description>The SSC output bit 1's min period will be (16 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of divided system clock.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
