Masmiseim36/nxpSDK/devices/MKE13Z7/MKE13Z7.xml
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO27</name>
              <description>Port Data Output</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_0</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_1</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO28</name>
              <description>Port Data Output</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_0</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_1</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO29</name>
              <description>Port Data Output</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_0</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_1</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO30</name>
              <description>Port Data Output</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_0</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_1</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDO31</name>
              <description>Port Data Output</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDO_0</name>
                  <description>Logic level 0 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDO_1</name>
                  <description>Logic level 1 is driven on pin, provided pin is configured for general-purpose output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PSOR</name>
          <description>Port Set Output Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTSO0</name>
              <description>Port Set Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO1</name>
              <description>Port Set Output</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO2</name>
              <description>Port Set Output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO3</name>
              <description>Port Set Output</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO4</name>
              <description>Port Set Output</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO5</name>
              <description>Port Set Output</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO6</name>
              <description>Port Set Output</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO7</name>
              <description>Port Set Output</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO8</name>
              <description>Port Set Output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO9</name>
              <description>Port Set Output</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO10</name>
              <description>Port Set Output</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO11</name>
              <description>Port Set Output</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO12</name>
              <description>Port Set Output</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO13</name>
              <description>Port Set Output</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO14</name>
              <description>Port Set Output</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO15</name>
              <description>Port Set Output</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO16</name>
              <description>Port Set Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO17</name>
              <description>Port Set Output</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO18</name>
              <description>Port Set Output</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO19</name>
              <description>Port Set Output</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO20</name>
              <description>Port Set Output</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO21</name>
              <description>Port Set Output</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO22</name>
              <description>Port Set Output</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO23</name>
              <description>Port Set Output</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO24</name>
              <description>Port Set Output</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
